app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@student = Student.find(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-07-16 21:34:45.677224"], ["updated_at", "2019-07-16 21:34:45.677224"]]
---
	def create
	  @student = Student.new(params.require(:student).permit(:first_name, :last_name))
	  @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-07-17 19:07:06.342723"], ["id", 1]]
---
	def update
	  @student = Student.find(params[:id])
	  @student.update(params.require(:student).permit(:title))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
	  @student = Student.find(params[:id])